files/sns/app/controllers/users_controller.rb

  def create
    stat = User.create params.permit(:login_id, :name, :pass, :icon_file_name)
    render json: {errors: stat.errors.full_messages}, status: :bad_request and return if stat.errors.any?

    user = User.find_by 'login_id = ?', params[:login_id]
    # @directory
    icon_file_path = "#{Rails.root}/public/icons/#{user[:icon_file_name]}"
    puts icon_file_path
    puts File.file? icon_file_path
    puts default_icon_path unless File.file? icon_file_path
    user.update icon_file_name: default_icon_path unless File.file? icon_file_path
---
INSERT INTO `users` (`login_id`, `name`, `pass`, `icon_file_name`, `created_at`, `updated_at`) VALUES ('nishimunea', 'nishimunea', '059a00192592d5444bc0caad7203f98b506332e2cf7abb35d684ea9bf7c18f08', '47c0427a-1661-4b34-9a75-57f3701b3831.jpg', '2017-12-12 21:49:43', '2017-12-12 21:49:43')
SELECT  1 AS one FROM `users` WHERE `users`.`login_id` = BINARY 'taro' AND (`users`.`id` != 3) LIMIT 1
SELECT  `users`.* FROM `users` WHERE (login_id = 'nishimunea') LIMIT 1
UPDATE `users` SET `icon_file_name` = 'presets/3.png' WHERE `users`.`id` = 3

  def icon
    begin
      user = User.find params[:id]
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1